#Програма має виконувати прості математичні дії (+, -, *, /).
#Користувачеві пропонується почерзі ввести числа та дію над цими числами,
#а програма, виходячи з дії, обчислює та друкує результат.

# n1 = int(input('enter the first number:'))
# n2 = int(input('enter the second number:'))
# n3 = input('operation:')
#
# if n3 == "+":
#     print(n1+n2)
# elif n3 == '-':
#     print(n1-n2)
# elif n3 == '*':
#     print(n1*n2)
# elif n3 == '/':
#     if n2:
#         print(n1 / n2)
#     else:
#         print("Division by 0!")

#Ваша програма має перенести останній елемент списку з кінця на початок,
#тобто, останній елемент списку має стати першим.
#Послідовність інших елементів не має змінюватися.

# numbers = [1, 2, 3, 4, 5]
# numbers.insert(0, 5)
# numbers.pop()
# print(numbers)

#Ваша програма повинна вміти розділяти один список на два та помістити їх у новий список.
#Тобто, в результаті повинен вийти список із 2-х списків.

#v1
n1 = [1, 2, 3, 4, 5, 6]
my_n1 = n1[0:3]
my_n2 = n1[3:6]
n1 = [my_n1] + [my_n2]
print(n1)

#v2
n1 = [1, 2, 3, 4, 5]
my_n1 = n1[0:3]
my_n2 = n1[3:6]
n1 = [my_n1] + [my_n2]
print(n1)

#v3
n1 = [1, 2, 3]
my_n1 = n1[0:2]
my_n2 = n1[2:3]
n1 = [my_n1] + [my_n2]
print(n1)


n1 = [1]
my_n1 = n1[0:1]
my_n2 = n1[1:1]
n1 = [my_n1] + [my_n2]
print(n1)

n1 = []
my_n1 = n1[0:1]
my_n2 = n1[1:1]
n1 = [my_n1] + [my_n2]
print(n1)